In [17]:
# Importing dependencies that will be used for the code.
import json
import pandas as pd
from pprint import pprint
import datetime
# Importing json data.
json_data = json.load(open("dogbites.json"))

In [18]:
# Creating a data specific DataFrame.
dog_data = pd.DataFrame(json_data["data"], columns=[
  "drop_code1",
  "drop_code2",
  "drop_code3",
  "drop_code4",
  "drop_code5",
  "drop_code6",
  "drop_code7",
  "drop_code8",
  "unique_id",
  "incident_date",
  "species",
  "breed",
  "age",
  "gender",
  "spay_neuter_status",
  "borough",
  "zip_code"
])

In [19]:
# Specifying columns to drop.
drop_columns = [
  "drop_code1",
  "drop_code2",
  "drop_code3",
  "drop_code4",
  "drop_code5",
  "drop_code6",
  "drop_code7",
  "drop_code8",
  "species",
]

In [20]:
# Cleaning column headers.
dog_data_clean = dog_data.drop(columns=drop_columns)
dt_format = None
dog_data_clean['age'] = dog_data_clean["age"].replace("Y", "", regex=True)
dog_data_clean['incident_date'] = pd.to_datetime(dog_data_clean["incident_date"], format=dt_format)
dog_data_clean['breed'] = dog_data_clean["breed"].str.lower()
dog_data_clean = dog_data_clean[dog_data_clean["borough"] != 'Other']

In [21]:
# Sorting and printing data.
dog_data_clean = dog_data_clean.sort_values("incident_date")
dog_data_clean = dog_data_clean.reset_index(drop=True)
dog_data_clean

,unique_id,incident_date,breed,age,gender,spay_neuter_status,borough,zip_code
0,9350,2015-01-01,pit bull,None,M,False,Staten Island,10301
1,14,2015-01-01,american pit bull terrier/pit bull,None,U,False,Brooklyn,11220
2,6829,2015-01-01,bull dog,3,F,False,Queens,None
3,4,2015-01-01,american pit bull terrier/pit bull,6,M,False,Brooklyn,11221
4,4043,2015-01-01,mixed/other,10,M,True,Manhattan,10065
...,...,...,...,...,...,...,...,...
24982,1292,2022-12-31,unknown,None,U,False,Bronx,10463
24983,1293,2022-12-31,yorkshire terrier crossbreed,1,M,False,Bronx,10452
24984,1294,2022-12-31,unknown,None,U,False,Bronx,10469
24985,1297,2022-12-31,maltese,6,F,True,Bronx,10456
24986,1299,2022-12-31,cock-a-poo,6,M,False,Bronx,10461

In [22]:
# Exporting DataFrames to csv files.
dog_data_clean.to_csv("cleaned_data.csv")

In [23]:
# Creating table DataFrames.
# Dogbite locations.
dogbite_locations_df = dog_data_clean[["borough","zip_code"]].copy()
dogbite_locations_df = pd.DataFrame(dogbite_locations_df)
# dogbite_locations_df = dogbite_locations_df.groupby(["borough"])
dogbite_locations_df

             borough zip_code
0      Staten Island    10301
1           Brooklyn    11220
2             Queens     None
3           Brooklyn    11221
4          Manhattan    10065
...              ...      ...
24982          Bronx    10463
24983          Bronx    10452
24984          Bronx    10469
24985          Bronx    10456
24986          Bronx    10461

[24987 rows x 2 columns]